In [1]:
import pandas as pd
import numpy as np

In [28]:
df=pd.read_csv('Data_from.csv',encoding='cp1252')
df.sample(5)

,v1,v2,Unnamed: 2,Unnamed: 3,Unnamed: 4
5068,ham,Hai dear friends... This is my new &amp; prese...,NaN,NaN,NaN
4723,spam,FREE GAME. Get Rayman Golf 4 FREE from the O2 ...,NaN,NaN,NaN
1570,ham,No:-)i got rumour that you going to buy apartm...,NaN,NaN,NaN
187,spam,Please call our customer service representativ...,NaN,NaN,NaN
1424,ham,Yes.. now only saw your message..,NaN,NaN,NaN

Data Claning

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5572 entries, 0 to 5571
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   v1          5572 non-null   object
 1   v2          5572 non-null   object
 2   Unnamed: 2  50 non-null     object
 3   Unnamed: 3  12 non-null     object
 4   Unnamed: 4  6 non-null      object
dtypes: object(5)
memory usage: 217.8+ KB

In [ ]:
df.drop(columns=['Unnamed: 0'], inplace=True)
df.drop(columns=['Unnamed: 0.1'], inplace=True)
df.drop(columns=['Unnamed: 0.1.1'], inplace=True)